In [1]:
a=10
b=20
c=a+b
print(c)

30

In [ ]:
==================== Data Analysis ===================================

1. Pandas       : Data frame analysis
2. Numpy        : Numerical analysis
3. matplotlib   : Graphs and plots
4. seaborn      : plots
5. Bokhe        : plots
6. plotly       : plots

================== Machine learning ==================================

7. stats         : for statistical models
8. scikit-learn(sklearn) : ML models

================= Deep learning ======================================

9. opencv         : Computer vision
10. pillow        : Image operations
11. tensorflow    : Neural Network creations (developed by google)
12. keras         : NN
13. pytorch       : alternative package of tensorflow (facebook meta)

================= NLP ================================================

14. NLTK          : Natural language toolkit
15. SpaCy         : Alternative to NLTK
16. wordcloud     : most frequent occured words

================ Scarapping ==========================================

17. SqLite        : Data base creation
18. Beautiful soup
19. Selenium

================= API creations ======================================

20. Flask
21. FastAPI
22. Gradio
23. Django

=============== UI app creation =======================================

24. Streamlit

================Transfer learning models(DL) ==========================

25. Mobilenet
26. Resenet
27. VGGnet
28. Inception
29. Yolo         : Ultralytics

=================== Transfer learning models(NLP) =====================

30. Word2vec
31. GloVe

================== Huging Face Transformers ===========================

32. BERT     : Bi Directional Encoder representation of Transformers

=================== Allen NLP =========================================

33. Allen NLP packages

=================== GenAI =============================================
    
34. LangChain
35. Google GeminiAi related packages
36. OpenAI GPT related packages
37. Amazon BedRock related packages
38. Meta Llama related packages

================== Image and Video Generations ========================

39. GAN models related packages
40. SORA related packages

================== Model deployment ( MlOps) ==========================
    
41. mlflow using databricks
42. kubeflow (GCP account)

================== Cloud applications =================================

43. Azure ML related packages
44. GCP VertexAI related packages
45. AWS Sagemaker related packages

================= small ===============================================
46. time
47. logging
48. math
49. random
50. env
51. os

#### **Step-1: Import packages**

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

#### **Step-2: Create a Dataframe using list**

- data  : your either list or dict
  
- index : we need to provide a list

- columns : we need to provide a list

In [3]:
import pandas as pd
name=['Ramesh','Suresh','Satish']
pd.DataFrame(name)

        0
0  Ramesh
1  Suresh
2  Satish

In [4]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,
            columns=['Names'])
# pd.DataFrame (data, index, columns)

    Names
0  Ramesh
1  Suresh
2  Satish

#### **Step-3: Change the index**

In [5]:
names=['Ramesh','Suresh','Satish']
pd.DataFrame(names,
             index=['A','B','C'],
             columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Satish

In [6]:
names=['Ramesh','Suresh','Satish']
idx=['A','B','C']
pd.DataFrame(names,
             index=idx,
             columns=['Names'])

    Names
A  Ramesh
B  Suresh
C  Satish

#### **Step-4: Add multiple columns**

In [7]:
names=['Ramesh','Suresh','Satish']
age=[20,22,24]
pd.DataFrame(zip(names,age),
            columns=['Names','Age'])

    Names  Age
0  Ramesh   20
1  Suresh   22
2  Satish   24

#### **Step-5: Create empty dataframe and update the columns**

In [8]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df['Age']=[20,21,22]
df.index=[1,2,3]
df

    Names  Age
1  Ramesh   20
2  Suresh   21
3  Satish   22

#### **Step-6: Add a new column with existing dataframe**

In [9]:
names=['Ramesh','Suresh','Satish']
age=[21,22,24]
df=pd.DataFrame(zip(names,age),
                index=[1,2,3],
                columns=['Names','Age'])
df['City']=['Hyd','Pune','Blr']
df

    Names  Age  City
1  Ramesh   21   Hyd
2  Suresh   22  Pune
3  Satish   24   Blr

#### **Step-7: overwrite the column values**

- I want to overwrite my age values

- originally age is = [21,22,24]

- now i want to update the age = [30,32,34]

In [10]:
names=['Ramesh','Suresh','Satish']
age=[21,22,24]
df=pd.DataFrame(zip(names,age),
                columns=['Names','Age'])
df['City']=['Hyd','Pune','Blr']
df['Age']=[30,32,34]
df

    Names  Age  City
0  Ramesh   30   Hyd
1  Suresh   32  Pune
2  Satish   34   Blr

In [11]:
names=['Ramesh','Suresh','Satish']

df=pd.DataFrame(zip(names,age),
                columns=['Names','Age'])
df['City']=['Hyd','Pune','Blr']
df['age']=[30,32,34]
df

    Names  Age  City  age
0  Ramesh   21   Hyd   30
1  Suresh   22  Pune   32
2  Satish   24   Blr   34

#### **Step-8: Drop the column**

- labels
- axis
- index
- columns
- inplace

In [12]:
df.drop('age') # error
# here python assume age is a label
# python ask qn : is it index label or column
# axis=1 means for columns
# axis=0 means for rows
# by default axis=0

KeyError: "['age'] not found in axis"

In [ ]:
df.drop('age',axis=0) # error

In [ ]:
df.drop('age',axis=1)

In [ ]:
df # we are able to see old column
   # because we did not apply inplace=True

In [ ]:
# whenever we use columns label
# no need of axis
df.drop(columns=['age'],
        inplace=True
        )

In [ ]:
df

In [ ]:
# drop index=2

df.drop(index=2)

### **Step-9: Rename the column**

In [ ]:
mapper: dictionary={'City':'city'}
index:
columns:
axis:
copy:
inplace:

In [13]:
import pandas as pd
names=['Ramesh','Suresh','Satish']
age=[21,22,24]
df=pd.DataFrame(zip(names,age),
                index=[1,2,3],
                columns=['Names','Age'])
df['City']=['Hyd','Pune','Blr']
df

# I want to change City column: city

    Names  Age  City
1  Ramesh   21   Hyd
2  Suresh   22  Pune
3  Satish   24   Blr

In [14]:
dict1={'City':'city'}
df.rename(dict1)

    Names  Age  City
1  Ramesh   21   Hyd
2  Suresh   22  Pune
3  Satish   24   Blr

In [15]:
dict1={'City':'city'}
df.rename(dict1,axis=1)

    Names  Age  city
1  Ramesh   21   Hyd
2  Suresh   22  Pune
3  Satish   24   Blr

In [16]:
dict1={'City':'city'}
df.rename(columns=dict1)

    Names  Age  city
1  Ramesh   21   Hyd
2  Suresh   22  Pune
3  Satish   24   Blr

In [17]:
dict1={'City':'city'}
df.rename(columns=dict1,
          inplace=True)
df

    Names  Age  city
1  Ramesh   21   Hyd
2  Suresh   22  Pune
3  Satish   24   Blr

In [18]:
# can you change 2 to 'B'
dict1={2:'B'}
df.rename(dict1,
         inplace=True)

In [19]:
df

    Names  Age  city
1  Ramesh   21   Hyd
B  Suresh   22  Pune
3  Satish   24   Blr

In [20]:
dict1={2:'B'}
df.rename(index=dict1)

    Names  Age  city
1  Ramesh   21   Hyd
B  Suresh   22  Pune
3  Satish   24   Blr

In [21]:
dict1={2:'B'}
df.rename(dict1,axis=0)

    Names  Age  city
1  Ramesh   21   Hyd
B  Suresh   22  Pune
3  Satish   24   Blr

In [22]:
df1=pd.DataFrame()
df1['value']=[i for i in range(1,10)]
df1['square_value']=[i**2 for i in range(1,10)]
df1['cube_value']=[i**3 for i in range(1,10)]
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

- len
- columns
- shape
- dtypes
- head
- tail

In [24]:
df1.columns

Index(['value', 'square_value', 'cube_value'], dtype='object')

In [25]:
list(df1.columns)

['value', 'square_value', 'cube_value']

In [26]:
df1.columns.to_list()

['value', 'square_value', 'cube_value']

In [27]:
df1.shape
# 9 rows and 3 columns

(9, 3)

In [28]:
df1.dtypes
# integer we will get integer
# float we will get float 
# string we will get object

value           int64
square_value    int64
cube_value      int64
dtype: object

In [29]:
df.dtypes

Names    object
Age       int64
city     object
dtype: object

In [30]:
df1.head(2)
# starting first

   value  square_value  cube_value
0      1             1           1
1      2             4           8

In [31]:
df1.tail(2)
# starting last

   value  square_value  cube_value
7      8            64         512
8      9            81         729

In [32]:
len(df1)

9

In [33]:
df1.isnull()
# we are asking a qn
# a null value available or not
# True or False
# True means yes NULL available
# False means no NULL available

   value  square_value  cube_value
0  False         False       False
1  False         False       False
2  False         False       False
3  False         False       False
4  False         False       False
5  False         False       False
6  False         False       False
7  False         False       False
8  False         False       False

In [34]:
df1.isnull().sum()
# column wise null value count will display

value           0
square_value    0
cube_value      0
dtype: int64

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   value         9 non-null      int64
 1   square_value  9 non-null      int64
 2   cube_value    9 non-null      int64
dtypes: int64(3)
memory usage: 348.0 bytes

### **Step-10**

- How to change a specific value of a column

- df1.drop
    - either it will drop column or index

- df1.rename
    - either it will rename column or index

- df1.replace

In [36]:

# replace cube_value 64 to 464

df1.replace(64,464) # all the data will replace

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

In [37]:
df1.replace({64:464,1:111}) # all the data will replace

   value  square_value  cube_value
0    111           111         111
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

### **Step-11: Selection of a column**

In [38]:
df1['cube_value']
# series
# series looks like dataframe
# rows and columns

0      1
1      8
2     27
3     64
4    125
5    216
6    343
7    512
8    729
Name: cube_value, dtype: int64

In [39]:
type(df1)

pandas.core.frame.DataFrame

In [40]:
type(df1['cube_value'])

pandas.core.series.Series

In [41]:
df1.shape # 2 Dimensional

(9, 3)

In [42]:
df1['cube_value'].shape 
# 1 Dimensional data

(9,)

In [43]:
type(df1[['cube_value']])

pandas.core.frame.DataFrame

In [44]:
df1[['cube_value']]

   cube_value
0           1
1           8
2          27
3          64
4         125
5         216
6         343
7         512
8         729

In [45]:
type(df1[['cube_value']])
df1[['cube_value']].shape

(9, 1)

In [46]:
# square_value
# cube_value
# multiple always keep those in list
df1[['cube_value','square_value']]

   cube_value  square_value
0           1             1
1           8             4
2          27             9
3          64            16
4         125            25
5         216            36
6         343            49
7         512            64
8         729            81

In [47]:
df1['cube_value'].replace(64,464,inplace=True)

In [48]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

### **Step-12: How to append a row**

- loc # loc for name

- iloc # iloc for number

In [49]:
# df1.loc[rows,columns]
# df1.iloc[rows,columns]

# we can select particular rows and columns using a list : [start:stop:step]

df1.iloc[3:7,1:3]
df1.loc[3:7,['square_value','cube_value']]
cols=['square_value','cube_value']
df1.loc[3:7,cols]

   square_value  cube_value
3            16         464
4            25         125
5            36         216
6            49         343
7            64         512

In [50]:
cols=['square_value','cube_value']
df1.loc[3:7,cols]

   square_value  cube_value
3            16         464
4            25         125
5            36         216
6            49         343
7            64         512

In [51]:
df1.iloc[[2,3,4]]

   value  square_value  cube_value
2      3             9          27
3      4            16         464
4      5            25         125

In [52]:
df1.iloc[[2]]
# 2D in DataFrame

   value  square_value  cube_value
2      3             9          27

In [53]:
df1.iloc[2]
# 1D in series

value            3
square_value     9
cube_value      27
Name: 2, dtype: int64

In [54]:
df1.iloc[[2,3,4],[0,2]]
# 2,3,4 rows
# 0 and 2nd index(1,3)

   value  cube_value
2      3          27
3      4         464
4      5         125

In [55]:
df1.iloc[2,0]

np.int64(3)

In [56]:
df1.iloc[:,0]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: value, dtype: int64

In [57]:
df1.iloc[2,:]

value            3
square_value     9
cube_value      27
Name: 2, dtype: int64

In [58]:
df1.iloc[[2],:]

   value  square_value  cube_value
2      3             9          27

In [59]:
df1.iloc[2:6,0]

2    3
3    4
4    5
5    6
Name: value, dtype: int64

In [60]:
df1.iloc[2:6,[0]]

   value
2      3
3      4
4      5
5      6

### **how to append the row**

In [61]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [62]:
df1.loc[9]=[10,100,1000]

In [63]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729
9     10           100        1000

In [64]:
len(df1)

10

In [65]:
ID=len(df1)
df1.loc[ID]=[10,200,2000]
df1

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           200        2000

### **Step-13: Save the dataframe**

- we can save dataframes in two ways

- .csv

- .xlsx

- where I want to save : directory

- what the filename to save: filename

- what is the type of a file : extension

- different folder: r"C:\Users\dell\OneDrive\Documents\nareshit\GeminiAi\data1.csv"

- different folder: r"C:\Users\dell\OneDrive\Documents\nareshit\GeminiAi\data1.xlsx"

- same folder: r"data1.csv" or r"data1.xlsx"

In [66]:
csv_path=r"C:\Users\dell\OneDrive\Documents\nareshit\GeminiAi\data1.csv"
excel_path=r"C:\Users\dell\OneDrive\Documents\nareshit\GeminiAi\data1.xlsx"
df1.to_csv(csv_path)
df1.to_excel(excel_path)

In [67]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path)
df1.to_excel(excel_path)

### **Step-14: Read the Data**

In [68]:
csv_path=r"data1.csv"
pd.read_csv(csv_path)

    Unnamed: 0  value  square_value  cube_value
0            0      1             1           1
1            1      2             4           8
2            2      3             9          27
3            3      4            16         464
4            4      5            25         125
5            5      6            36         216
6            6      7            49         343
7            7      8            64         512
8            8      9            81         729
9            9     10           100        1000
10          10     10           200        2000

In [69]:
excel_path=r"data1.xlsx"
pd.read_excel(excel_path)

    Unnamed: 0  value  square_value  cube_value
0            0      1             1           1
1            1      2             4           8
2            2      3             9          27
3            3      4            16         464
4            4      5            25         125
5            5      6            36         216
6            6      7            49         343
7            7      8            64         512
8            8      9            81         729
9            9     10           100        1000
10          10     10           200        2000

In [70]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path,index=False)   # index column created extra
df1.to_excel(excel_path,index=False)# index column created extra

In [71]:
csv_path=r"data1.csv"
pd.read_csv(csv_path)

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         464
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           200        2000

In [4]:
import pandas as pd
visa_df=r"Visadataset.csv"
bank_df=r"C:\Users\dell\OneDrive\Documents\nareshit\Datafile\data2.csv"
pd.read_csv(visa_df)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified